## Staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| add    | `aws_lambda_alias.api_latest`                   |
|        | `aws_lambda_permission.api_1`                   |
|        | `aws_lambda_provisioned_concurrency_config.api` |
| update | `aws_api_gateway_integration.integration`       |
|        | `aws_api_gateway_integration.root_integration`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-74i43aysii-es4f14-ANY"
      ~ uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:latest/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.root_integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "root_integration" {
        id                      = "agi-74i43aysii-4omy0e84ek-GET"
      ~ uri                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:latest/invocations" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_lambda_alias.api_latest will be created
  + resource "aws_lambda_alias" "api_latest" {
      + arn              = (known after apply)
      + description      = "The most recently deployed version of the API"
      + function_name    = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
      + function_version = "377"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "latest"
    }

  # aws_lambda_permission.api_1 will be created
  + resource "aws_lambda_permission" "api_1" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "api-lambda"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = "latest"
      + source_arn          = "arn:aws:execute-api:ca-central-1:239043911459:74i43aysii/*/*"
      + statement_id        = "AllowAPIGatewayInvoke1"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_provisioned_concurrency_config.api will be created
  + resource "aws_lambda_provisioned_concurrency_config" "api" {
      + function_name                     = "api-lambda"
      + id                                = (known after apply)
      + provisioned_concurrent_executions = 1
      + qualifier                         = "latest"
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.api_lambda,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "api_lambda":
   1: resource "aws_wafv2_web_acl" "api_lambda" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

36 tests, 17 passed, 19 warnings, 0 failures, 0 exceptions

```

</details>
